/*
Гэты скрыпт фарміруецца са змесціва старонкі [[Вікіпедыя:AutoWikiBrowser/Typos]].
Для абнаўлення скапіруйце тэкст з поля па спасылцы:
https://be.wikipedia.org/?title=Project:AutoWikiBrowser/Typos&action=edit&withgadget=wfTyposUpdate
*/

window.wfPlugins = window.wfPlugins || [];
window.wfPlugins.push(function (txt, r) {
  r(
    /((?:^|\s)[аА])б'я([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1б’я$2",
  );
  r(/((?:^|\s)[аА])днім(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1дным");
  r(
    /((?:^|\s)[аА])пэр([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1пер$2",
  );
  r(/((?:^|\s)[аА])собаў(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1соб");
  r(/((?:^|\s)[аА])сьц([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1сц$2");
  r(
    /((?:^|\s)[аА])кторк([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1ктрыс$2",
  );
  r(/((?:^|\s)[аА])ктор(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1кцёр");
  r(
    /((?:^|\s)[аА])льгарытм([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1лгарытм$2",
  );
  r(
    /((?:^|\s)[аА])мэрык([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1мерык$2",
  );
  r(/((?:^|\s)[аА])нгельшчына(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1нглія");
  r(/((?:^|\s)[аА])нгельшчыне(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1нгліі");
  r(/((?:^|\s)[аА])нгельшчыны(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1нгліі");
  r(
    /((?:^|\s)[аА])нгельск([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1нглійск$2",
  );
  r(
    /((?:^|\s)[аА])нтв[эе]рп[эе]н([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1нтверпен$2",
  );
  r(
    /((?:^|\s)[аА])ргентын([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1ргенцін$2",
  );
  r(
    /((?:^|\s)[бБ])азэл([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1азел$2",
  );
  r(
    /((?:^|\s)[бБ])азэл([А-ЯЁІЎа-яёіў]*)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1азел$2",
  );
  r(
    /((?:^|\s)[бБ])ізнэсмэ([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1ізнесме$2",
  );
  r(
    /((?:^|\s)[бБ])ляк([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1лак$2",
  );
  r(
    /((?:^|\s)[бБ])этон([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1етон$2",
  );
  r(/((?:^|\s)[бБ])этон(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1етон");
  r(/((?:^|\s)[бБ])олш(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1ольш$2");
  r(
    /((?:^|\s)[бБ])русэл([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1русел$2",
  );
  r(
    /((?:^|\s)[бБ])эрг([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1ерг$2",
  );
  r(
    /((?:^|\s)[вВ])аеначальні([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1оеначальні$2",
  );
  r(
    /((?:^|\s)[вВ])аяводз([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1аяводс$2",
  );
  r(
    /((?:^|\s)[вВ])елікагалов([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1ялікагалов$2",
  );
  r(
    /((?:^|\s)[вВ])елікадзяржаўн([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1ялікадзяржаўн$2",
  );
  r(/((?:^|\s)[вВ])ерасьн(я|ем|ю)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1ерасн$2");
  r(/((?:^|\s)[вВ])обласьц([ьію])(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1обласц$2");
  r(/((?:^|\s)[вВ])одарасцяў(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1одарасцей");
  r(
    /((?:^|\s)[Вв])ыстав(амі|а[юй]?|у)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1ыстаўк$2",
  );
  r(
    /((?:^|\s)[вВ])[эе]н[эе]р([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1енер$2",
  );
  r(
    /((?:^|\s)[вВ])эрф([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1ерф$2",
  );
  r(
    /((?:^|\s)[вВ])ялікадушн([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1елікадушн$2",
  );
  r(
    /((?:^|\s)[вВ])ялікакняжацк([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1елікакняжацк$2",
  );
  r(
    /((?:^|\s)[вВ])ялікалуцк([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1елікалуцк$2",
  );
  r(
    /((?:^|\s)[вВ])ялікамучанік([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1елікамучанік$2",
  );
  r(
    /((?:^|\s)[вВ])ялікаруск([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1елікаруск$2",
  );
  r(
    /((?:^|\s)[вВ])ялікасвецк([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1елікасвецк$2",
  );
  r(/((?:^|\s)[гГ])адзінаў(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1адзін");
  r(/((?:^|\s)[гГ])адох(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1адах");
  r(
    /((?:^|\s)[гГ])азэт([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1азет$2",
  );
  r(
    /((?:^|\s)[гГ])лябал([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1лабал$2",
  );
  r(
    /((?:^|\s)(?:студзеня|лютага|сакавіка|красавіка|мая|чэрвеня|ліпеня|жніўня|верасня|кастрычніка|лістапада|снежня))\]\] \[\[(\d+)\]\] году(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1]] [[$2]] года",
  );
  r(
    /((?:^|\s)[гГ])рамадзт([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1рамадст$2",
  );
  r(
    /((?:^|\s)[дД])амэнік([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1аменік$2",
  );
  r(/((?:^|\s)[дД])ачцы(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1ачцэ");
  r(
    /((?:^|\s)[дД])зевяты([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1зявяты$2",
  );
  r(
    /((?:^|\s)[дД])зесяты([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1зясяты$2",
  );
  r(
    /((?:^|\s)[дД])зеячк([А-ЯЁІЎа-яёіў]*)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1зяячк$2",
  );
  r(
    /((?:^|\s)[дД])зьвюх([А-ЯЁІЎа-яёіў]*)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1звюх$2",
  );
  r(
    /((?:^|\s)[дД])зяяч([А-ЯЁІЎа-яёіў]*)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1зеяч$2",
  );
  r(
    /((?:^|\s)[дД])ыплям([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1ыплам$2",
  );
  r(
    /((?:^|\s)[дД])ыплём([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1ыплом$2",
  );
  r(/((?:^|\s)[дД])'я([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1’я$2");
  r(/((?:^|\s)[жЖ])анаты на(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1анаты з");
  r(/((?:^|\s)[зЗ])аля(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1ала");
  r(/((?:^|\s)[зЗ])аляў(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1алаў");
  r(/((?:^|\s)[уУ]) залі(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1 зале");
  r(/((?:^|\s)[зЗ]) дапамогаю(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1 дапамогай");
  r(/((?:^|\s)[зЗ]) мэтаю(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1 мэтай");
  r(
    /((?:^|\s)[зЗ])ьвязн([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1вязн$2",
  );
  r(/((?:^|\s)[зЗ])ьвян(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1вян$2");
  r(/((?:^|\s)[зЗ])зьн([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1зн$2");
  r(/((?:^|\s)[зЗ])зьл([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1зл$2");
  r(/((?:^|\s)[зЗ])ья([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1’я$2");
  r(/((?:^|\s)[зЗ])'я([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1’я$2");
  r(/((?:^|\s)[іІ])мём(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1мем");
  r(
    /((?:^|\s)[іІ])нвэст([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1нвест$2",
  );
  r(
    /((?:^|\s)[іІ])нтэрне([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1нтэрнэ$2",
  );
  r(/((?:^|\s)[іІ])нтэрвію(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1нтэрв’ю");
  r(
    /((?:^|\s)[іІ])мпэр([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1мпер$2",
  );
  r(
    /((?:^|\s)[кК])азімер([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1азімір$2",
  );
  r(
    /((?:^|\s)[кК])алюмб([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1алумб$2",
  );
  r(
    /((?:^|\s)[кК])ампут[эа]р([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1амп’ютар$2",
  );
  r(
    /((?:^|\s)[кК])амп'ютэр([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1амп’ютар$2",
  );
  r(
    /((?:^|\s)[кК])анстанты([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1анстанці$2",
  );
  r(/((?:^|\s)[кК])аўкаскі(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1аўказскі");
  r(/((?:^|\s)[кК])апел(ай?|[уеы])(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1апэл$2");
  r(
    /((?:^|\s)[кК])ілямэтр([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1іламетр$2",
  );
  r(/((?:^|\s)[кК])ілямэтар(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1іламетр");
  r(
    /((?:^|\s)[кК])люб([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1луб$2",
  );
  r(/((?:^|\s)[кК])люб(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1луб");
  r(
    /((?:^|\s)[кК])лясыфік([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1ласіфік$2",
  );
  r(/((?:^|\s)[лЛ])етув([аеу])(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1ітв$2");
  r(/((?:^|\s)[лЛ])ёндан([аеу])(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1ондан$2");
  r(/((?:^|\s)[лЛ])ідэр(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1ідар");
  r(
    /((?:^|\s)[лЛ])ідэр([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1ідар$2",
  );
  r(
    /((?:^|\s)[лЛ])яўрэа([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1аўрэа$2",
  );
  r(
    /((?:^|\s)[лЛ])ягенд([А-ЯЁІЎа-яёіў]+|)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1егенд$2",
  );
  r(
    /((?:^|\s)[мМ])аянез([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1аянэз$2",
  );
  r(
    /((?:^|\s)[мМ])арсэл([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1арсел$2",
  );
  r(
    /((?:^|\s)[мМ])ачапала([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1очапала$2",
  );
  r(
    /((?:^|\s)[мМ])еньш(ы|ага|ым|аму|ыя|асць|асцей|асці|асцю|)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1енш$2",
  );
  r(
    /((?:^|\s)[нН])айменьш(ы|ага|ым|аму|ыя|)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1айменш$2",
  );
  r(/((?:^|\s)[мМ])ейсц(а?|ам|[eы])(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1есц$2");
  r(/((?:^|\s)[мМ])ескі(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1арадскі");
  r(/((?:^|\s)[мМ])еншасцяў(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1еншасцей");
  r(/((?:^|\s)[мМ])іністар(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1іністр");
  r(
    /((?:^|\s)[мМ])італёг([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1іфалог$2",
  );
  r(
    /((?:^|\s)[мМ])італяг([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1іфалаг$2",
  );
  r(/((?:^|\s)[мМ])оваў(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1оў");
  r(
    /((?:^|\s)[мМ])узэ([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1узе$2",
  );
  r(
    /((?:^|\s)[мМ])этад([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1етад$2",
  );
  r(/((?:^|\s)[мМ])этар(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1етр");
  r(/((?:^|\s)[мМ])этра(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1етра");
  r(/((?:^|\s)[мМ])этраў(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1етраў");
  r(/((?:^|\s)[мМ])этры(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1етры");
  r(
    /((?:^|\s)[мМ])[еэ]н[еэ]джм[еэ]н([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1енеджмен$2",
  );
  r(
    /((?:^|\s)[мМ])юнхэн([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1юнхен$2",
  );
  r(/((?:^|\s)[зЗнН])алежы(ў|л[аі])(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1алежа$2");
  r(
    /((?:^|\s)[нН])ідэрлянд([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1ідэрланд$2",
  );
  r(
    /((?:^|\s)[нН])эакласіц([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1еакласіц$2",
  );
  r(
    /((?:^|\s)[нН])эалі([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1еалі$2",
  );
  r(
    /((?:^|\s)[нН])эапал([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1еапал$2",
  );
  r(
    /((?:^|\s)[оО])пэр([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1пер$2",
  );
  r(/((?:^|\s)[пП])авал(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1авел");
  r(/((?:^|\s)[пП])а крайняй меры(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1рынамсі");
  r(
    /((?:^|\s)[пП])арлямэн([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1арламен$2",
  );
  r(/((?:^|\s)[пП])асьля(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1асля");
  r(/((?:^|\s)[пП])ектын(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1екцін");
  r(/((?:^|\s)[пП])ётар(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1ётр");
  r(
    /((?:^|\s)[пП])лян([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1лан$2",
  );
  r(/((?:^|\s)[пП])лян(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1лан");
  r(
    /((?:^|\s)[пП])радусар([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1радзюсар$2",
  );
  r(
    /((?:^|\s)[пП])рафэсар([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1рафесар$2",
  );
  r(
    /((?:^|\s)[пП])розьвішч([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1розвішч$2",
  );
  r(
    /((?:^|\s)[пП])расталінейн([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1росталінейн$2",
  );
  r(
    /((?:^|\s)[пП])рэзыдэн([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1рэзідэн$2",
  );
  r(/((?:^|\s)[пП])'я([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1’я$2");
  r(
    /((?:^|\s)[пП])эйзаж([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1ейзаж$2",
  );
  r(
    /((?:^|\s)[пП])эрыяд([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1ерыяд$2",
  );
  r(
    /((?:^|\s)[рР])асейск([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1асійск$2",
  );
  r(/((?:^|\s)[рР])асейская мова(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1уская мова");
  r(
    /((?:^|\s)[рР])аслаўл([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1ослаўл$2",
  );
  r(/((?:^|\s)[рР])эзэрв(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1эзерв");
  r(
    /((?:^|\s)[рР])айн([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1эйн$2",
  );
  r(/((?:^|\s)[рР])айн(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1эйн");
  r(/((?:^|\s)[рР])'я([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1’я$2");
  r(
    /((?:^|\s)[сС])ардын([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1ардзін$2",
  );
  r(/((?:^|\s)[сС])адавінай(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1адавіной");
  r(
    /((?:^|\s)[сС])езон (\d+) году(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1езон $2 года",
  );
  r(
    /((?:^|\s)[сС])екрэцы([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1акрэцы$2",
  );
  r(
    /((?:^|\s)[сС])партов([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1партыўн$2",
  );
  r(
    /((?:^|\s)[сС])тагодзьдз([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1тагоддз$2",
  );
  r(/((?:^|\s)[сС])таршынём(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1таршынёй");
  r(
    /((?:^|\s)[сС])урвет([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1урвэт$2",
  );
  r(/((?:^|\s)[сС])ляваччына(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1лавакія");
  r(/((?:^|\s)[сС])ляваччыне(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1лавакіі");
  r(/((?:^|\s)[сС])ляваччыны(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1лавакіі");
  r(/((?:^|\s)[сС])ьне([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1не$2");
  r(
    /((?:^|\s)[нН])амесьн([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1амесн$2",
  );
  r(/((?:^|\s)[сС])ьмех(у?|ам)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1мех$2");
  r(/((?:^|\s)[сС])ьв([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1в$2");
  r(/((?:^|\s)[сС])ымбаль(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1імвал");
  r(/((?:^|\s)[сС])ымбалем(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1імвалам");
  r(
    /((?:^|\s)[сС])экс([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1екс$2",
  );
  r(
    /((?:^|\s)[сС])эрвер([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1ервер$2",
  );
  r(
    /((?:^|\s)[сС])эры([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1еры$2",
  );
  r(
    /((?:^|\s)[сС])фэр([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1фер$2",
  );
  r(
    /((?:^|\s)[сС])ымэтр([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1іметр$2",
  );
  r(
    /((?:^|\s)[сС])юрэалізм([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1юррэалізм$2",
  );
  r(/((?:^|\s)[тТ])окіо(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "Токіа");
  r(/((?:^|\s)[тТ])окіё(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "Токіа");
  r(
    /((?:^|\s)[тТ])унел([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1унэл$2",
  );
  r(
    /((?:^|\s)[тТ])ок-шоў([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1ок-шоу$2",
  );
  r(/((?:^|\s)[тТ])экста(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1эксту");
  r(
    /((?:^|\s)[уУў])ладзіме([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1ладзімі$2",
  );
  r(
    /((?:^|\s)[уУў])нів[эе]рс[іы]тэ([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1ніверсітэ$2",
  );
  r(
    /((?:^|\s)[фФ])альсыф([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1альсіф$2",
  );
  r(/((?:^|\s)[фФ])аун(а?|ай|[eуы])(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1аўн$2");
  r(
    /((?:^|\s)[фФ])ізы([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1ізі$2",
  );
  r(
    /((?:^|\s)[фФ])ляндры(я?|[юі]|яй)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1ландры$2",
  );
  r(/((?:^|\s)[фФ])эномэн(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1еномен");
  r(
    /((?:^|\s)[фФ])[эе]нам[эе]н([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1енамен$2",
  );
  r(
    /((?:^|\s)[хХ])аас([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1аос$2",
  );
  r(/((?:^|\s)[хХ])вілінаў(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1вілін");
  r(/((?:^|\s)[цЦ])энтар(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1энтр");
  r(/((?:^|\s)[чЧ])алец(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1лен");
  r(/((?:^|\s)[чЧ])альцом(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1ленам");
  r(/((?:^|\s)[чЧ])альцы(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1лены");
  r(/((?:^|\s)[шШ])атлянды([яію])(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "$1атланды$2");
  r(
    /((?:^|\s)[шШ])вайцар([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1вейцар$2",
  );
  r(
    /((?:^|\s)[эЭ])кземпляр([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1кзэмпляр$2",
  );
  r(
    /((?:^|\s)[эЭ])ксп[эе]рым[эе]н([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1ксперымен$2",
  );
  r(/((?:^|\s)[эЭ])ўра (?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "Еўра ");
  r(
    /((?:^|\s)[эЭ])ўрапейск([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "Еўрапейск$2",
  );
  r(/((?:^|\s)[эЭ])ўроп([уа]|[ые]|ай)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g, "Еўроп$2");
  r(
    /((?:^|\s)[эЭ]|[еЕ])ўразвяз([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "Еўрасаюз$2",
  );
  r(
    /((?:^|\s)[эЭ])фэкт([А-ЯЁІЎа-яёіў]+)(?=[^A-ZА-ЯЁІЎa-zа-яёіў́]|$)/g,
    "$1фект$2",
  );
});
